{
  "basics": {
    "name": "Mirza Farhan Bin Tarek",
    "label": "Ph.D. Student",
    "image": "",
    "email": "mfarhan@udel.edu",
    "url": "https://mirzafarhan7.github.io",
    "summary": "I am a dedicated and passionate individual pursuing a Ph.D. in Computer Science at the University of Delaware. My research interests lie at the intersection of machine learning, healthcare, and fairness. Currently, my research focuses on harnessing large language models (LLMs) to generate fair and unbiased clinical data, such as clinical vignettes and notes. I thrive on challenges and am constantly motivated to expand my knowledge and skill set.",
    "location": {
      "address": "Smith Hall, 18 Amstel Ave",
      "postalCode": "DE 19711",
      "city": "Newark",
      "countryCode": "US",
      "region": "Delaware"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "mirzafarhanbintarek",
        "url": "https://www.linkedin.com/in/mirzafarhanbintarek/"
      }
    ]
  },
  "work": [
    {
      "name": "University of Delaware",
      "position": "Graduate Teaching Assistant",
      "startDate": "2022-08",
      "endDate": "",
      "summary": "I have served as the Infrastructure Teaching Assistant (TA), responsible for assisting the Academic Advisor with the development of a web-based application designed to streamline the process of sending offer letters to a diverse group of TAs while efficiently managing their office hours scheduling in addition to other functionalities. It involved leveraging a tech stack that includes HTML, CSS, JavaScript, FastAPI, Jinja2, and Python to create a user-friendly and automated system that enhances the TA onboarding experience and ensures seamless communication with teaching staff."
    },
    {
      "name": "University of Delaware",
      "position": "Instructor (On Contract)",
      "startDate": "2023-08",
      "endDate": "",
      "summary": "As the instructor of CISC181- Introduction to Computer Science II, I am responsible for giving lectures to students, grading the assessments, and designing and updating the curriculum."
    }
  ],
  "education": [
    {
      "institution": "University of Delaware",
      "location": "Delaware, USA",
      "url": "https://www.cis.udel.edu/academics/graduate-programs/phd-in-computer-science/",
      "area": "Computer Science",
      "studyType": "Ph.D.",
      "startDate": "2022-08",
      "endDate": "",
      "courses": [
      "CISC 621 ALGORITHM DESIGN AND ANALYSIS",
      "CISC 637 DATABASE SYSTEMS",
      "CISC 655 COMM SKILLS FOR CS RESEARCH",
      "CISC 662 COMPUTER SYSTEMS: ARCHITECTURE",
      "CISC 681 ARTIFICIAL INTELLIGENCE",
      "CISC 684 MACHINE LEARNING",
      "CISC 849 ADV TPCS IN COMPUTER APPLICATION: Research in Accessible Computing",
      "CISC 889 ADVANCED DEEP LEARNING"
    ]
    },
    {
      "institution": "Staffordshire University",
      "location": "Staffordshire, UK",
      "url": "https://www.staffs.ac.uk/",
      "area": "Computer Science",
      "studyType": "Individual Modules (Erasmus+ KA1 Mobility Program)",
      "startDate": "2017",
      "endDate": "2018"
    },
    {
      "institution": "United International University, Dhaka, Bangladesh",
      "location": "Dhaka, Bangladesh",
      "url": "https://cse.uiu.ac.bd/ug-program/",
      "area": "Computer Science and Engineering",
      "studyType": "Bachelor of Science (BSc)",
      "startDate": "2014",
      "endDate": "2018",
      "score": "3.99"
    }
  ],
   "awards": [{
    "title": "Summa Cum Laude",
    "date": "2018",
    "awarder": "United International University, Dhaka, Bangladesh"
  },
     {
    "title": "Participated in the Erasmus+ KA1 mobility program (Funded by Erasmus+ EU)",
    "date": "2017-2018",
    "awarder": "Erasmus+",
    "summary": "Under the award, I studied at Staffordshire University, Staffordshire, United Kingdom for 6 months. There I took three graduate-level courses and completed my undergraduate thesis work titled \"Spatio-temporal analysis of large air pollution data\" under Dr. Md Asaduzzaman"
  }
   ],
  "certificates": [
    {
      "name": "Deep Learning Specialization",
      "date": "2018",
      "issuer": "Coursera",
      "url": "https://coursera.org/share/84241848e71f7e9b512f077c10671891"
    },
    {
      "name": "Web development using ASP.NET",
      "date": "2017",
      "issuer": "CDIP (Centre for Development of IT Professionals), United International University, Dhaka, Bangladesh"
    }
  ],
  "publications": [
    {
      "name": "Improving fairness in AI models on electronic health records: The case for federated learning methods",
      "publisher": "Proceedings of the 2023 ACM Conference on Fairness, Accountability, and Transparency",
      "releaseDate": "2023",
      "url": "https://dl.acm.org/doi/10.1145/3593013.3594102",
      "summary": "Developing AI tools that preserve fairness is of critical importance, specifically in high-stakes applications such as those in healthcare. However, health AI models' overall prediction performance is often prioritized over the possible biases such models could have. In this study, we show one possible approach to mitigate bias concerns by having healthcare institutions collaborate through a federated learning paradigm (FL; which is a popular choice in healthcare settings). While FL methods with an emphasis on fairness have been previously proposed, their underlying model and local implementation techniques, as well as their possible applications to the healthcare domain remain widely underinvestigated. Therefore, we propose a comprehensive FL approach with adversarial debiasing and a fair aggregation method, suitable to various fairness metrics, in the healthcare domain where electronic health records are used. Not only our approach explicitly mitigates bias as part of the optimization process, but an FL-based paradigm would also implicitly help with addressing data imbalance and increasing the data size, offering a practical solution for healthcare applications. We empirically demonstrate our method's superior performance on multiple experiments simulating large-scale real-world scenarios and compare it to several baselines. Our method has achieved promising fairness performance with the lowest impact on overall discrimination performance (accuracy)."
    },
    {
      "name": "Spatio-temporal analysis of large air pollution data",
      "publisher": "2018 10th International Conference on Electrical and Computer Engineering (ICECE), IEEE",
      "releaseDate": "2018",
      "url": "https://ieeexplore.ieee.org/abstract/document/8636696/",
      "summary": "Air pollution is one of the most dangerous environmental threats in our planet. Although it is severe in highly populated and industrialized cities of developing countries, it is a major concern for developed countries as well. In the developed world, air quality data is gathered from a large number of air pollution monitoring stations. However, the volume of data is very high and it is not possible to analyze the data efficiently in real-time using the conventional methods. Hence, large scale data mining techniques can help in analyzing those data more efficiently and dynamically. In this paper, a method for mining large amount of air pollution data is proposed for finding air pollution hot spots and time of pollution using clustering methods and time-series analysis. The results, after using the method to the air pollution data of PM 2 . 5 , PM 10 and ozone in the United Kingdom from 2015-17, has shown that the pollution due to particulate matters was higher in winter season and ozone pollution had downward trend except some areas."
    }
  ],
  "skills": [
    {
      "name": "Programming Languages",
      "keywords": [
        "Python",
        "Java",
        "C"
      ]
    },
    {
      "name": "Database",
      "keywords": [
        "MySQL",
        "ORACLE"
      ]
    },
    {
      "name": "Web Dev and Software Engineering",
      "keywords": [
        "HTML",
        "CSS",
        "FASTAPI",
        "JINJA2"
      ]
    },
    {
      "name": "Machine Learning",
      "keywords": [
        "ML libraries like scikit-learn, PyTorch"
      ]
    },
    {
      "name": "Misc.",
      "keywords": [
        "LATEX typesetting and publishing",
        "Academic Research"
      ]
    }
  ],
  "Machine Learning": [
    {
      "language": "Bengali",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Fluent",
      "icon": ""
    }
  ],
  "references": [
    {
      "name": "Dr. Rahmatollah Beheshti, Assistant Professor, Department of Computer & Information Sciences, University of Delaware"
    }
  ],
  "projects": [
    {
      "name": "Skin Cancer Classification with Ensemble of Deep Convolutional Neural Networks",
      "summary": "In this work, deep convolution networks e.g., VGG-16, Efficient NetB3, and ResNet-50 were used to identify skin cancer from dermoscopic images",
      "startDate": "2021",
      "endDate": "2021",
      "url": "https://github.com/mfarhan007/skin-cancer"
    }
  ]
}
